{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-LOC",
    "1": "B-LOCderiv",
    "2": "B-LOCpart",
    "3": "B-ORG",
    "4": "B-ORGderiv",
    "5": "B-ORGpart",
    "6": "B-OTH",
    "7": "B-OTHderiv",
    "8": "B-OTHpart",
    "9": "B-PER",
    "10": "B-PERderiv",
    "11": "B-PERpart",
    "12": "I-LOC",
    "13": "I-LOCderiv",
    "14": "I-ORG",
    "15": "I-ORGpart",
    "16": "I-OTH",
    "17": "I-PER",
    "18": "I-PERpart",
    "19": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-LOC": 0,
    "B-LOCderiv": 1,
    "B-LOCpart": 2,
    "B-ORG": 3,
    "B-ORGderiv": 4,
    "B-ORGpart": 5,
    "B-OTH": 6,
    "B-OTHderiv": 7,
    "B-OTHpart": 8,
    "B-PER": 9,
    "B-PERderiv": 10,
    "B-PERpart": 11,
    "I-LOC": 12,
    "I-LOCderiv": 13,
    "I-ORG": 14,
    "I-ORGpart": 15,
    "I-OTH": 16,
    "I-PER": 17,
    "I-PERpart": 18,
    "O": 19
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 28996
}
